"espk" = "Apple-høyttalerport";
"ispk" = "Innebygd";
"emic" = "Mikrofoninngang";
"imic" = "Innebygd";
"hdpn" = "Hodetelefonport";
"lini" = "Linjeinngang for lyd";
"lino" = "Linjeutgang for lyd";
"spdi" = "Optisk digital inngang";
"spdo" = "Optisk digital utgang";
"pci " = "PCI-kort";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Nettverksenhet";
"blue" = "Bluetooth";
"bluh" = "Bluetooth-hodetelefoner";
"blus" = "Bluetooth-headset";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
